# PointFlexibleConstrained Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointFlexibleConstrained Property
ParameterTypeId Class See Also
---
"Constrained"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointFlexibleConstrained { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointFlexibleConstrained As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointFlexibleConstrained {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace